*** Interpreter
    #+begin_notes
    Husk å kjøre pyvenv-activate før kodenblokkene kan kjøres.
    #+end_notes
    #+begin_src python :exports none :session *Python*
      import os
      os.chdir("./src")
    #+end_src

    #+RESULTS:
    : None
    
    #+begin_src python :results output replace :exports both :session *Python*
      from interpreter import interpret
      brainfuck_H = ("++++++++++++"
                     "++++++++++++"
                     "++++++++++++"
                     "++++++++++++"
                     "++++++++++++"
                     "++++++++++++" ".")
      brainfuck_e = ("++++++++++++++++++++"
                     "++++++++++++++++++++"
                     "++++++++++++++++++++"
                     "++++++++++++++++++++"
                     "+++++++++++++++++++++" ".")
      brainfuck_i = "++++" + brainfuck_e
      brainfuck_letters = [brainfuck_H, brainfuck_e, brainfuck_i]
      print([interpret(letter) for letter in brainfuck_letters])
    #+end_src

    #+RESULTS:
    : [('H', [72], 0), ('e', [101], 0), ('i', [105], 0)]
    
*** Hello world
    #+begin_src python :results output replace :exports both :session *Python*
      brainfuck_hello = ("++++++++[>++++[>++>+++>+++>+<<<<-]>+>+>->>+"
                         "[<]<-]>>.>---.+++++++..+++.>>.<-.<.+++.----"
                         "--.--------.>>+.>++.")
      print(interpret(brainfuck_hello))
    #+end_src

    #+RESULTS:
    : ('Hello World!\n', [0, 0, 72, 100, 87, 33, 10], 6)

*** Belønningsfunksjon
    #+begin_src python :results output replace :exports both :session *Python*
      from agent import calculate_reward
      results = ["", "H", "Hw", "Hwaaaaaa", "Hwaa wrl"]
      target = "Hello world"
      print([calculate_reward("", res, target) for res in results])
    #+end_src

    #+RESULTS:
    : [0.0, 3.0, 5.0, 11.0, 14.0]

